In [1]:
import pandas as pd

In [2]:
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
f = [1,2,3,4,-5,-4,-3,-2,-1,0,100]
f = list(filter(lambda x: x > 0, f))
f

[1, 2, 3, 4, 100]

In [17]:
sr.apply(lambda x: x ** 2).sum()

55

In [33]:
sr = pd.Series([100,200,300],index=['Moscow','Mytischi','Severobaykalks'])

sr['Moscow':'Mytischi'].sum(), sr[['Moscow','Severobaykalks']].sum()

(300, 400)

In [34]:
# sr[['Moscow','Severobaykalks']] = 0
sr

Moscow            100
Mytischi          200
Severobaykalks    300
dtype: int64

In [41]:
sr[sr > 0]

Moscow            100
Mytischi          200
Severobaykalks    300
dtype: int64

In [54]:
sr = pd.Series([100,200,300])
sr = sr.append(pd.Series([400,]),ignore_index=True)
sr

0    100
1    200
2    300
3    400
dtype: int64

In [73]:
sr = pd.Series(
    {
        'Moscow': 5000000,
        'Mytischi': 70000,
        'Severobaykalsk': 3000
    }
)

sr.index = sr.index.to_series().apply(lambda x: x[:2].upper())
sr

MO    5000000
MY      70000
SE       3000
dtype: int64

In [107]:
df = pd.DataFrame({
    'name': ['Yandex','PM','HSE','Mytischi','Pushkino','Korolev'],
    'students_num': [300,300,200,500,100,100],
    'city': ['Moscow','Moscow','Moscow','Mytischi','Pushkino','Korolev'],
    'weekday_classes': [False,True,True,True,True,True]
})
df

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [77]:
df.head(2) # Вывести первые N строк(5 по умолчанию)

     name  students_num    city  weekday_classes
0  Yandex           300  Moscow            False
1      PM           300  Moscow             True

In [78]:
df.tail(2) # Вывести последние N строк( 5  по умолчанию )

       name  students_num      city  weekday_classes
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [90]:
df[(df['city'] == 'Moscow') | (df['city'] == 'Mytischi')]

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True

In [93]:
df[(df['name'] == 'Yandex') & (df['city'] == 'Moscow')]

     name  students_num    city  weekday_classes
0  Yandex           300  Moscow            False

In [94]:
df.columns

Index(['name', 'students_num', 'city', 'weekday_classes'], dtype='object')

In [95]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [108]:
df['kek'] = 'kek' # Создали
df = df.drop(['kek'],axis='columns') #Убили
# df

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [116]:
df['is_unique'] = (df['name'] == df['city'])
df.index = df['name'].apply(lambda x:x[:2].upper())
df.index.name = 'CODE'
df

          name  students_num      city  weekday_classes  is_unique
CODE
YA      Yandex           300    Moscow            False      False
PM          PM           300    Moscow             True      False
HS         HSE           200    Moscow             True      False
MY    Mytischi           500  Mytischi             True       True
PU    Pushkino           100  Pushkino             True       True
KO     Korolev           100   Korolev             True       True

In [129]:
df.loc['YA':'HS',['city','students_num']]

        city  students_num
CODE
YA    Moscow           300
PM    Moscow           300
HS    Moscow           200

In [174]:
df[df['students_num'] > 200]

          name  students_num      city  weekday_classes  is_unique
CODE
YA      Yandex           300    Moscow            False      False
PM          PM           300    Moscow             True      False
MY    Mytischi           500  Mytischi             True       True